robotology/icub-firmware/emBODY/arch-armcmx/body/abslayer/hal-package/hal/hal-src/stm32fx/brdcfg/hal_brdcfg_ems001.c
}
 
extern void hal_brdcfg_switch__configure(hal_eth_phymode_t* phymode)
{
    hal_eth_phymode_t phymode2use = hal_eth_phymode_fullduplex100mbps;
    const uint8_t fd100 = 0x60;
    const uint8_t fd010 = 0x20;
    uint8_t buff_write = 0x60; // FORCE FULL DUPLEX AND 100T
    uint8_t buff_read = 0xFF; 
    volatile uint32_t i = 1;
    hal_i2c_regaddr_t regadr = {.numofbytes = 1, .bytes.one = 0};
    
    if(NULL != phymode)
    {
        phymode2use = *phymode;
    }


    regadr.bytes.one = 0x01;
    hal_i2c4hal_read(hal_i2c_port1, 0xBE, regadr, &buff_read, 1);
    if((buff_read&0x01))
    {   // already initted. to be initted again must pass through a reset
        s_hal_brdcfg_switch__mii_phymode_get(phymode);
        return;
    }
    
    
    if(hal_eth_phymode_none == phymode2use)
    {
        if(NULL != phymode)
        {
            *phymode = hal_eth_phymode_none;    
        }   
        return;        
    }


    

#if 0    
    // configure mii
    regadr.bytes.one = 0x06;
    hal_i2c4hal_read(hal_i2c_port1, 0xBE, regadr, &buff_read, 1);
    buff_write  = buff_read;
    buff_write |= 0x10; 
    hal_i2c4hal_write(hal_i2c_port1, 0xBE, regadr, &buff_write, 1);
    hal_i2c4hal_read(hal_i2c_port1, 0xBE, regadr, &buff_read, 1);
#endif

    // 1. configure  switch's ports 1 and 2
    switch(phymode2use)
    {
        case hal_eth_phymode_auto:                  buff_write = 0x9F; break;
        case hal_eth_phymode_halfduplex10mbps:      buff_write = 0x00; break;
        case hal_eth_phymode_halfduplex100mbps:     buff_write = 0x40; break;
        case hal_eth_phymode_fullduplex10mbps:      buff_write = 0x20; break;
        case hal_eth_phymode_fullduplex100mbps:     buff_write = 0x60; break;
        default:                                    buff_write = 0x00; break;
    }    
    
    
    // port 1
    regadr.bytes.one = 0x1C;
    hal_i2c4hal_read(hal_i2c_port1, 0xBE, regadr, &buff_read, 1);
    hal_i2c4hal_write(hal_i2c_port1, 0xBE, regadr, &buff_write, 1);
    hal_i2c4hal_read(hal_i2c_port1, 0xBE, regadr, &buff_read, 1);
     
    // port 2 
    regadr.bytes.one = 0x2C;
    hal_i2c4hal_read(hal_i2c_port1, 0xBE, regadr, &buff_read, 1);
    hal_i2c4hal_write(hal_i2c_port1, 0xBE, regadr, &buff_write, 1);   
    hal_i2c4hal_read(hal_i2c_port1, 0xBE, regadr, &buff_read, 1);

    // 2. start the switch
    buff_write = 0x1;  
    regadr.bytes.one = 0x01;    
    hal_i2c4hal_write(hal_i2c_port1, 0xBE, regadr, &buff_write, 1);
    

    // 3. read back to verify
    regadr.bytes.one = 0x01;
    hal_i2c4hal_read(hal_i2c_port1, 0xBE, regadr, &buff_read, 1);
    if(!(buff_read&0x01))
    {
        hal_base_hid_on_fatalerror(hal_fatalerror_runtimefault, "s_hal_switch_reg_config(): SWITCH not configured");
    }
    
    s_hal_brdcfg_switch__mii_phymode_get(phymode);
    
}

#endif//HAL_USE_SWITCH


#ifdef HAL_USE_ETH

extern hal_bool_t hal_brdcfg_eth__phy_initialise(void)
{
    #warning --> in here we just init the switch ... put in reset mode, exit from reset, do the mco, init the i2c if not initted, etc. 
    if(hal_false == hal_switch_initted_is())
    {
        hal_switch_init(NULL);
    }
    
    return(hal_true);
}

extern void hal_brdcfg_eth__phy_configure(hal_eth_phymode_t *phymode)
{
    hal_eth_phymode_t target = hal_brdcfg_eth__phymode;
 
//    if((hal_eth_mux_auto == target.mux) || (hal_eth_mux_none == target.mux) || (hal_eth_speed_auto == target.speed) || (hal_eth_speed_none == target.speed))
    if(hal_eth_phymode_none == target)
    {
        if(NULL != phymode)
        {
            *phymode  = hal_eth_phymode_none;
        }   
        return;        
    }    
    
    hal_switch_start(&target);
    
    if(NULL != phymode)
    {
        *phymode  = target;     
    }
}


#endif//HAL_USE_ETH


#ifdef HAL_USE_SYS
extern void hal_brdcfg_sys__clock_config(void)
{
 
}

extern void hal_brdcfg_sys__gpio_default_init(void)
{

#if 0

//
//#define   IN_ANALOG          0x0
//#define   IN_FLOATING        0x04
//#define   OUT_PUSH_PULL_2M   0x2
//#define   IN_PUL_UP          0x8



// 1) abilito il clock per tutte le porte GPIO (A, B, C, D, E) una volta per tutte.
    RCC->APB2ENR |= 0x0000007D;
// 2) configuro i pin di tutte le porte

/*
    PORT A: pin 0 to 7
        - pin 0: lascia cosi' come e' inizializzato (input -floating)
        - pin 1: lascia cosi' come e' inizializzato (input -floating)
        - pin 2: GPOUT 2MHz 
        - pin 3: Analog input 
        - pin 4: Analog input
        - pin 5: GPOUT 2MHz   (valore basso)
        - pin 6: input PullUp
        - pin 7: GPOUT 2MHz    (valore basso)
*/
    GPIOA->CRL   &= 0x000000FF;  //reset
    GPIOA->CRL   |= 0x28288200;  //config
    GPIOA->BRR   |= ((1 << 5) |  (1 << 7)); //set val low


/*
    PORT A: pin 8 to 15
        - pin 8: GPOUT 2MHz
        - pin 9: GPOUT 2MHz (valore alto)
        - pin 10: input PullUp
        - pin 11: input PullUp
        - pin 12:  input PullUp
        - pin 13:  lascia cosi' come e' inizializzato  (Jtag nopn toccare)
        - pin 14:  lascia cosi' come e' inizializzato  (Jtag nopn toccare)
        - pin 15:  lascia cosi' come e' inizializzato   (Jtag nopn toccare)
*/
 GPIOA->CRH   &= 0xFFF00000;  //reset
 GPIOA->CRH   |= 0x00088822;   //config

 GPIOA->BSRR   |= ((1 << 9) ); //set val high




/*
    PORT B: pin 0 to 7
        - pin 0: input PullUp
        - pin 1: input PullUp
        - pin 2: GPOUT 2MHz   (valore basso)
        - pin 3: lascia cosi' come e' inizializzato   (Jtag nopn toccare)
        - pin 4: lascia cosi' come e' inizializzato   (Jtag nopn toccare)
        - pin 5: input PullUp
        - pin 6: GPOUT 2MHz    (valore alto)
        - pin 7: GPOUT 2MHz    (valore alto)
*/
    GPIOB->CRL   &= 0x00000000;  //reset
    GPIOB->CRL   |= 0x22800288;  //config
    GPIOB->BSRR   |= ((1 << 6) |  (1 << 7)); //set val high
    GPIOB->BRR   |= ((1 << 2) ); //set val low


/*
    PORT B pin 8 to 15
        - pin 8: lascia cosi' come e' inizializzato (perche' hanno la resistenza)
        - pin 9: lascia cosi' come e' inizializzato (perche' hanno la resistenza)
        - pin 10: lascia cosi' come e' inizializzato (perche' hanno la resistenza)
        - pin 11: GPOUT 2MHz    (valore basso)
        - pin 12: GPOUT 2MHz    (valore basso)
        - pin 13: GPOUT 2MHz    (valore basso)
        - pin 14:  GPOUT 2MHz    (valore alto)  (anche se hanno la loro resistenza)
        - pin 15: GPOUT 2MHz    (valore alto)   (anche se hanno la loro resistenza)
*/
    GPIOB->CRH   &= 0x00000FFF;  //reset
    GPIOB->CRH   |= 0x22222000;   //config
    
    GPIOB->BSRR   |= ((1 << 14) | (1 << 15) ); //set val high
    GPIOB->BRR   |= ((1 << 11) | (1 << 12) | (1 << 13)); //set val low






